In [1]:
import pandas as pd

In [2]:
# 1-1 flight data - airports which shows the least and highest arrival
flight = pd.read_csv('data/hflights.csv')
flight.head()

,Year,Month,DayofMonth,DayOfWeek,DepTime,ArrTime,UniqueCarrier,FlightNum,TailNum,ActualElapsedTime,...,ArrDelay,DepDelay,Origin,Dest,Distance,TaxiIn,TaxiOut,Cancelled,CancellationCode,Diverted
0,2011,1,1,6,1400.0,1500.0,AA,428,N576AA,60.0,...,-10.0,0.0,IAH,DFW,224,7.0,13.0,0,NaN,0
1,2011,1,2,7,1401.0,1501.0,AA,428,N557AA,60.0,...,-9.0,1.0,IAH,DFW,224,6.0,9.0,0,NaN,0
2,2011,1,3,1,1352.0,1502.0,AA,428,N541AA,70.0,...,-8.0,-8.0,IAH,DFW,224,5.0,17.0,0,NaN,0
3,2011,1,4,2,1403.0,1513.0,AA,428,N403AA,70.0,...,3.0,3.0,IAH,DFW,224,9.0,22.0,0,NaN,0
4,2011,1,5,3,1405.0,1507.0,AA,428,N492AA,62.0,...,-3.0,5.0,IAH,DFW,224,9.0,9.0,0,NaN,0

In [3]:
flight['Dest'].value_counts()

Dest
DAL    9820
ATL    7886
MSY    6823
DFW    6653
LAX    6064
       ...
PSP     106
GUC      86
GRK      42
BPT       3
AGS       1
Name: count, Length: 116, dtype: int64

In [4]:
arrival_count = flight['Dest'].value_counts()

# max
print(arrival_count.idxmax(), arrival_count.max())

# min
print(arrival_count.idxmin(), arrival_count.min())

DAL 9820
AGS 1

In [5]:
# 1-2 # of missing values in the column 'DepTime'
flight['DepTime'].isna().sum()

2905

In [6]:
# 2-1 airquality data - calculate the median of Ozone excluding missing values
air = pd.read_csv('data/airquality.csv')
air.head()

   Ozone  Solar.R  Wind  Temp  Month  Day
0   41.0    190.0   7.4    67      5    1
1   36.0    118.0   8.0    72      5    2
2   12.0    149.0  12.6    74      5    3
3   18.0    313.0  11.5    62      5    4
4    NaN      NaN  14.3    56      5    5

In [7]:
ozone_median = air['Ozone'].dropna().median()
ozone_median

31.5

In [8]:
# 2-2 replace the missing values with the median and calculate the average of Ozone
air['Ozone'].fillna(ozone_median, inplace=True)
air['Ozone'].mean()

C:\Users\syj43\AppData\Local\Temp\ipykernel_6728\3124530947.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  air['Ozone'].fillna(ozone_median, inplace=True)

39.55882352941177

In [10]:
# to avoid the warning msg,
air['Ozone'] = air['Ozone'].fillna(ozone_median)
air['Ozone'].mean()

39.55882352941177

In [11]:
# 3-1 diamonds data - the highest price?
diamonds = pd.read_csv('data/diamonds.csv')
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [13]:
diamonds['price'].max()

18823

In [15]:
# 3-2 groupping in terms of cut and color and calculate the average
diamonds.groupby(['cut','color'])['price'].mean().reset_index().head()

    cut color        price
0  Fair     D  4291.061350
1  Fair     E  3682.312500
2  Fair     F  3827.003205
3  Fair     G  4239.254777
4  Fair     H  5135.683168

In [16]:
# 3-3 sort the data in the descending order and print the top three
diamonds_groupped = diamonds.groupby(['cut','color'])['price'].mean().reset_index().head()
diamonds_groupped.sort_values(by='price', ascending=False).head(3)

    cut color        price
4  Fair     H  5135.683168
0  Fair     D  4291.061350
3  Fair     G  4239.254777

In [17]:
# 3-4 count classifications of cut
diamonds['cut'].value_counts()

cut
Ideal        21551
Premium      13791
Very Good    12082
Good          4906
Fair          1610
Name: count, dtype: int64

In [18]:
# 3-5 their ratio
cut_percentage = diamonds['cut'].value_counts() / len(diamonds) * 100
cut_percentage

cut
Ideal        39.953652
Premium      25.567297
Very Good    22.398962
Good          9.095291
Fair          2.984798
Name: count, dtype: float64

In [19]:
cut_percentage['Fair']

2.9847979236188356

In [20]:
# 4-1 gapminder data - which continent shows a higher population, Europe and Africa? In what year?
gapminder = pd.read_csv('data/gapminder.csv')
gapminder.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [21]:
# boolean indexing to single out rows which conern Europe and Africa
gapminder_two = gapminder[(gapminder['continent']=='Europe')|(gapminder['continent']=='Africa')]
gapminder_two.head()

    country continent  year  lifeExp      pop    gdpPercap
12  Albania    Europe  1952    55.23  1282697  1601.056136
13  Albania    Europe  1957    59.28  1476505  1942.284244
14  Albania    Europe  1962    64.82  1728137  2312.888958
15  Albania    Europe  1967    66.22  1984060  2760.196931
16  Albania    Europe  1972    67.69  2263554  3313.422188

In [29]:
gapminder_two.groupby(['continent','country']).max().reset_index()

   continent         country  year  lifeExp       pop     gdpPercap
0     Africa         Algeria  2007   72.301  33333216   6223.367465
1     Africa          Angola  2007   42.731  12420476   5522.776375
2     Africa           Benin  2007   56.728   8078314   1441.284873
3     Africa        Botswana  2007   63.622   1639131  12569.851770
4     Africa    Burkina Faso  2007   52.295  14326203   1217.032994
..       ...             ...   ...      ...       ...           ...
77    Europe           Spain  2007   80.941  40448191  28821.063700
78    Europe          Sweden  2007   80.884   9031088  33859.748350
79    Europe     Switzerland  2007   81.701   7554661  37506.419070
80    Europe          Turkey  2007   71.777  71158647   8458.276384
81    Europe  United Kingdom  2007   79.425  60776238  33203.261280

[82 rows x 6 columns]

In [31]:
gapminder_two_max = gapminder_two.groupby(['continent','country']).max().reset_index()
gapminder_two_max.loc[gapminder_two_max['pop'].idxmax(), ['country', 'year', 'pop']]

country      Nigeria
year            2007
pop        135031164
Name: 36, dtype: object